index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-24 Tue 13:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Option-Like Securities</title>
<meta name="author" content="Matt Brigida, Ph.D." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Option-Like Securities</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcdcb4e0">1. Callable Bonds</a></li>
<li><a href="#org6ed587c">2. Convertible Bonds/Preferred Stock</a></li>
<li><a href="#org86cb0c7">3. Warrants</a></li>
<li><a href="#orgf02343d">4. Collateralized Loans</a>
<ul>
<li><a href="#orgc91385f">4.1. As Call</a></li>
<li><a href="#org9eb5a15">4.2. As Put</a></li>
<li><a href="#org21abb8f">4.3. Put-Call Parity</a></li>
</ul>
</li>
<li><a href="#org2b16091">5. Corporate Equity (in Levered Firm)</a></li>
<li><a href="#orgb0642e1">6. Financial Engineering</a></li>
<li><a href="#org9b08c79">7. Exotic Options</a>
<ul>
<li><a href="#orgceaaf7a">7.1. Asian Option</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Once we had a coherent method to value options, we were able to approach valuing many securities as options. 
</p>

<div id="outline-container-orgcdcb4e0" class="outline-2">
<h2 id="orgcdcb4e0"><span class="section-number-2">1.</span> Callable Bonds</h2>
<div class="outline-text-2" id="text-1">
<p>
The issuing company has the right to buy the bond back at some price.  That is, the company has a call option on the bond.
</p>

<p>
So when you buy a callable bond, this is equivalent to entering into a <b>covered call spread</b> on the bond&#x2014;buying the bond and selling a call to the company.
</p>

<p>
How do we value a callable bond?  The callable bond will have a higher yield (coupon payment) than an equivalent <i>straight</i> bond.  The present value of the difference in coupon payments is the value of the option sold buy the bond buyer.
</p>

<p>
Note, the call option in the callable bond may be more complex than a typical call option of stock.  The bond may be call protected for some period of time or it may be a "make-whole call".
</p>
</div>
</div>

<div id="outline-container-org6ed587c" class="outline-2">
<h2 id="org6ed587c"><span class="section-number-2">2.</span> Convertible Bonds/Preferred Stock</h2>
<div class="outline-text-2" id="text-2">
<p>
These are securities where you have the option to exchange the bond/preferred stock for a given amount of common stock.
</p>

<p>
For example, a bond with a conversion value of 10 allows you to convert a $1000 face value bond into 10 shares of common stock.  If the bond's price is 80, then you would want to convert the bond to stock if the stock's price is above $80 per share.
</p>

<ul class="org-ul">
<li>Most <i>converts</i> are out of the money.</li>
<li>Price greater than the \(max(conversion\ value, straight\ bond\ value)\)</li>
</ul>

<p>
Benefits of a bond: interest tax deductible
</p>

<ul class="org-ul">
<li><i>Converts</i> often behave like stock.</li>
</ul>
</div>
</div>

<div id="outline-container-org86cb0c7" class="outline-2">
<h2 id="org86cb0c7"><span class="section-number-2">3.</span> Warrants</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Employee Stock Options!</li>

<li>Warrants dilute present stockholders (company issues stock at exercise).</li>
</ul>
</div>
</div>

<div id="outline-container-orgf02343d" class="outline-2">
<h2 id="orgf02343d"><span class="section-number-2">4.</span> Collateralized Loans</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgc91385f" class="outline-3">
<h3 id="orgc91385f"><span class="section-number-3">4.1.</span> As Call</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Say you take out a loan for $X with an asset worth \(S_T\) as collateral.  At maturity of the loan:
</p>

<ul class="org-ul">
<li>If the asset is worth \(S_T > X\) then you pay back the loan and have \(S_T - X\).</li>

<li>If \(S_T < X\) then you default which forfeits \(S_T\) for $X.</li>
</ul>

<p>
That is you receive \(max(S_T - X, 0)\) at maturity.
</p>
</div>
</div>

<div id="outline-container-org9eb5a15" class="outline-3">
<h3 id="org9eb5a15"><span class="section-number-3">4.2.</span> As Put</h3>
<div class="outline-text-3" id="text-4-2">
<p>
You can look at the loan as equivalent to the borrower being able to sell (put) the collateral to the lender for $X.  You would do so if \(X - S_T > 0\).
</p>
</div>
</div>

<div id="outline-container-org21abb8f" class="outline-3">
<h3 id="org21abb8f"><span class="section-number-3">4.3.</span> Put-Call Parity</h3>
<div class="outline-text-3" id="text-4-3">
<p>
\(S_0 +P_0 = C_0 + \frac{X}{(1+r_f)}\)
</p>
</div>
</div>
</div>

<div id="outline-container-org2b16091" class="outline-2">
<h2 id="org2b16091"><span class="section-number-2">5.</span> Corporate Equity (in Levered Firm)</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Note: Original Black-Scholes Valuation.</li>
</ul>

<p>
Say a firm has $L in debt, and $A in assets.  Due to limited liability the value of the firm's equity is: (balance sheet identity A = L + E)
</p>

<ul class="org-ul">
<li>\(A-L\) if \(A > L\)</li>
<li>\(0\) if \(A \leq L\)</li>
</ul>

<p>
or \(max(A - L, 0)\)
</p>

<p>
Which is a call option with L strike price and A underlying.
</p>

<p>
Does this have any implications for investor preferences??? =&gt; Stockholders want the company to be risky.
</p>
</div>
</div>

<div id="outline-container-orgb0642e1" class="outline-2">
<h2 id="orgb0642e1"><span class="section-number-2">6.</span> Financial Engineering</h2>
<div class="outline-text-2" id="text-6">
<p>
MITTs: Buy bond and call.
</p>
</div>
</div>

<div id="outline-container-org9b08c79" class="outline-2">
<h2 id="org9b08c79"><span class="section-number-2">7.</span> Exotic Options</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgceaaf7a" class="outline-3">
<h3 id="orgceaaf7a"><span class="section-number-3">7.1.</span> Asian Option</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Strike price is an average of the underlying's price.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2023-10-24 Tue 13:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>